# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [1]:
# load %sql magic extension
%load_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///Movies.db

'Connected: @Movies.db'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [24]:
%%sql

/* *** Querying MovieTitle, TheaterName, ShowTime; Only limiting to 10 rows to save space *** */

SELECT MTitle AS MovieTitle, Show_Time AS ShowTime, TName AS TheaterName
FROM MOVIE
JOIN SHOW USING (MID)
JOIN THEATER USING (TID)
LIMIT 10;

 * sqlite:///Movies.db
Done.

[('Associate, The', '5:00 PM', 'General Cinema Rancho 6'),
 ('Associate, The', '7:30 PM', 'General Cinema Rancho 6'),
 ('Associate, The', '4:40 PM', 'Cinema Star The Ultraplex 14'),
 ('Associate, The', '7:30 PM', 'Cinema Star The Ultraplex 14'),
 ('Associate, The', '4:20 PM', 'Akarakian Theatres Moreno 4 Cinemas'),
 ('Associate, The', '7:20 PM', 'Akarakian Theatres Moreno 4 Cinemas'),
 ('Associate, The', '9:40 PM', 'Akarakian Theatres Moreno 4 Cinemas'),
 ('Ghost & The Darkness, The', '10:05 PM', 'Pacific Inland Center'),
 ('Ghost & The Darkness, The', '5:15 PM', 'Pacific Inland Center'),
 ('Ghost & The Darkness, The', '7:40 PM', 'Pacific Inland Center')]

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

In [48]:
%%sql

/* *** Querying for Movie Title, Theater Name, and Show Time ONLY AFTER 7:00pm while only showing the first 10 rows *** */

SELECT MTitle AS MovieTitle, Show_Time AS ShowTime, TName AS TheaterName
FROM MOVIE
JOIN SHOW USING (MID)
JOIN THEATER USING (TID)
WHERE Show_Time > "7:00 PM"
LIMIT 10;

 * sqlite:///Movies.db
Done.

[('Associate, The', '7:30 PM', 'General Cinema Rancho 6'),
 ('Associate, The', '7:30 PM', 'Cinema Star The Ultraplex 14'),
 ('Associate, The', '7:20 PM', 'Akarakian Theatres Moreno 4 Cinemas'),
 ('Associate, The', '9:40 PM', 'Akarakian Theatres Moreno 4 Cinemas'),
 ('Ghost & The Darkness, The', '7:40 PM', 'Pacific Inland Center'),
 ('Ghost & The Darkness, The', '7:15 PM', 'United Artists Riverside Park Sierra'),
 ('Ghost & The Darkness, The', '9:15 PM', 'SOCAL Canyon Crest Cinema'),
 ('Ghost & The Darkness, The', '7:20 PM', 'SOCAL Canyon Springs Cinema'),
 ('Ghost & The Darkness, The', '9:50 PM', 'SOCAL Canyon Springs Cinema'),
 ('Ghost & The Darkness, The', '7:40 PM', 'Cinema Star The Ultraplex 14')]

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [72]:
%%sql

/* *** Querying for Movie Title, Actor Name, Movie ID and Actor ID and only showing the first 10 rows *** */

SELECT AID, Name AS Actor_Name, MID, MTitle AS MovieTitle
FROM MOVIE
JOIN CREDIT USING (MID)
JOIN ARTISTS USING (AID)
LIMIT 10;

 * sqlite:///Movies.db
Done.

[(1, 'Austin Pendleton', 1, 'Associate, The'),
 (2, 'Bebe Neuwirth', 1, 'Associate, The'),
 (3, 'Dianne Wiest', 1, 'Associate, The'),
 (4, 'Eli Wallach', 1, 'Associate, The'),
 (5, 'Kenny Kerr', 1, 'Associate, The'),
 (6, 'Lainie Kazan', 1, 'Associate, The'),
 (7, 'Tim Daly', 1, 'Associate, The'),
 (8, 'Whoopi Goldberg', 1, 'Associate, The'),
 (9, 'Donald Petrie', 1, 'Associate, The'),
 (10, 'Bernard Hill', 2, 'Ghost & The Darkness, The')]

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [79]:
%%sql

/* *** Querying for Actor Name, Count of Distinct Movies per Actor, and Actor ID and Limiting to 10 rows *** */

SELECT DISTINCT Name AS Actor_Name, COUNT(MTitle) AS MovieCount, AID
FROM ARTISTS
JOIN CREDIT USING (AID)
JOIN MOVIE USING (MID)
GROUP BY Name
ORDER BY Name ASC
LIMIT 10;

 * sqlite:///Movies.db
Done.

[('Aidan Quinn', 1, 93),
 ('Alan Rickman', 1, 94),
 ('Anna Paquin', 1, 111),
 ('Anthony Hopkins', 1, 132),
 ('Arlene Sanford', 1, 147),
 ('Austin Pendleton', 1, 1),
 ('Barbra Streisand', 2, 60),
 ('Barry Levinson', 1, 82),
 ('Baz Luhrmann', 1, 105),
 ('Bebe Neuwirth', 1, 2)]

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [89]:
%%sql

SELECT DISTINCT Name AS Actor_Name, COUNT(MTitle) AS MovieCount, AID
FROM ARTISTS
JOIN CREDIT USING (AID)
JOIN MOVIE USING (MID)
GROUP BY Name
HAVING MovieCount > 1;

 * sqlite:///Movies.db
Done.

[('Barbra Streisand', 2, 60),
 ('Bill Murray', 2, 53),
 ('Campbell Scott', 2, 106),
 ('Diane Venora', 2, 100),
 ('Jada Pinkett', 2, 117),
 ('Minnie Driver', 2, 77),
 ('Rob Lieberman', 2, 35),
 ('Stanley Tucci', 2, 109),
 ('Vivica Fox', 2, 28)]

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.

In [191]:
%%sql

SELECT DISTINCT Name AS ArtistName, COUNT((SELECT CCode FROM ARTISTS WHERE CCode='A')) as NumActorCredits, COUNT((SELECT CCode FROM ARTISTS WHERE CCode='D')) AS NumDirectorCredits
FROM ARTISTS
JOIN CREDIT USING (AID)
JOIN MOVIE USING (MID)
GROUP BY Name
LIMIT 10;

 * sqlite:///Movies.db
Done.

[('Aidan Quinn', 1, 0),
 ('Alan Rickman', 1, 0),
 ('Anna Paquin', 1, 0),
 ('Anthony Hopkins', 1, 0),
 ('Arlene Sanford', 0, 1),
 ('Austin Pendleton', 1, 0),
 ('Barbra Streisand', 1, 1),
 ('Barry Levinson', 0, 1),
 ('Baz Luhrmann', 0, 1),
 ('Bebe Neuwirth', 1, 0)]